#+title: Sprint Backlog 01 for Niam
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) }

* Mission Statement

- create football manager program

* Stories


** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-03-19 Mon 14:10]
| <75>                                                                        |         |       |       |       |
| Headline                                                                    | Time    |       |       |     % |
|-----------------------------------------------------------------------------+---------+-------+-------+-------|
| *Total time*                                                                | *64:03* |       |       | 100.0 |
|-----------------------------------------------------------------------------+---------+-------+-------+-------|
| Stories                                                                     | 64:03   |       |       | 100.0 |
| Active                                                                      |         | 64:03 |       | 100.0 |
| STARTED Sprint and product backlog grooming                                 |         |       |  0:30 |   0.8 |
| COMPLETED Clone hedgr                                                       |         |       |  0:30 |   0.8 |
| COMPLETED Diagram                                                           |         |       |  1:00 |   1.6 |
| COMPLETED Create table standings classes                                    |         |       |  1:18 |   2.0 |
| COMPLETED Review                                                            |         |       |  0:20 |   0.5 |
| COMPLETED Create match classes                                              |         |       |  2:06 |   3.3 |
| COMPLETED Test Program                                                      |         |       |  0:23 |   0.6 |
| COMPLETED Discuss tasks                                                     |         |       |  0:19 |   0.5 |
| COMPLETED Add constructors to table class                                   |         |       |  0:29 |   0.8 |
| COMPLETED Add to table classes                                              |         |       |  4:56 |   7.7 |
| COMPLETED Fix table function                                                |         |       |  1:32 |   2.4 |
| COMPLETED Add setw to table                                                 |         |       |  1:00 |   1.6 |
| COMPLETED Discuss tasks                                                     |         |       |  0:35 |   0.9 |
| COMPLETED Analyse code                                                      |         |       |  2:21 |   3.7 |
| COMPLETED fix table bug                                                     |         |       |  1:09 |   1.8 |
| COMPLETED Test code                                                         |         |       |  1:00 |   1.6 |
| COMPLETED Fix quit bug                                                      |         |       |  1:00 |   1.6 |
| COMPLETED Fix match and add season                                          |         |       |  2:49 |   4.4 |
| COMPLETED Review                                                            |         |       |  1:45 |   2.7 |
| COMPLETED Go through last weeks work                                        |         |       |  1:00 |   1.6 |
| COMPLETED Discuss tasks                                                     |         |       |  0:40 |   1.0 |
| COMPLETED Create match fixtures                                             |         |       |  5:28 |   8.5 |
| COMPLETED Review                                                            |         |       |  0:46 |   1.2 |
| COMPLETED Make match by using file                                          |         |       |  9:58 |  15.6 |
| Make matches                                                                |         |       | 14:19 |  22.4 |
| Research for match problem                                                  |         |       |  2:49 |   4.4 |
| CANCELLED try fixing match with std::shuffle                                |         |       |  2:31 |   3.9 |
| COMPLETED write permutations out                                            |         |       |  1:30 |   2.3 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:

*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2018-03-06 Tue 16:00]--[2018-03-06 Tue 16:30] =>  0:30

Updates to sprint and product backlog

*** COMPLETED Clone hedgr
    CLOSED: [2018-03-06 Tue 10:58]
    CLOCK: [2018-03-06 Tue 09:30]--[2018-03-06 Tue 10:00] =>  0:30
git clone : (copy address from github)
*** COMPLETED Diagram
    CLOSED: [2018-03-06 Tue 11:00]
    CLOCK: [2018-03-06 Tue 10:00]--[2018-03-06 Tue 11:00] =>  1:00
Pull Diagram changes
Review Diagram
Discuss
*** COMPLETED Create table standings classes
    CLOSED: [2018-03-06 Tue 12:18]
    CLOCK: [2018-03-06 Tue 11:00]--[2018-03-06 Tue 12:18] =>  1:18
1. rename table to table_standings
2. remove all the stuff in it
3. add the vector
4. create table_standings_entry
5. add the properties

*** COMPLETED Review
    CLOSED: [2018-03-06 Tue 13:53]
    CLOCK: [2018-03-06 Tue 12:30]--[2018-03-06 Tue 12:50] =>  0:20
- Look at PG changes
- Look at diagram (match/matchday)
*** COMPLETED Create match classes
    CLOSED: [2018-03-06 Tue 16:00]
    CLOCK: [2018-03-06 Tue 13:54]--[2018-03-06 Tue 16:00] =>  2:06
- fix push
0 - create list of objectives
1 - think about match object in real life terms
2 - remove any match related code
3 - create match class files
4 - add properties
5 - create match day class
6 - add properties
*** COMPLETED Test Program
    CLOSED: [2018-03-06 Tue 16:54]
    CLOCK: [2018-03-06 Tue 16:30]--[2018-03-06 Tue 16:53] =>  0:23
- check changes
- check what works
*** COMPLETED Discuss tasks
    CLOSED: [2018-03-07 Wed 09:19]
    CLOCK: [2018-03-07 Wed 09:00]--[2018-03-07 Wed 09:19] =>  0:19

*** COMPLETED Add constructors to table class
    CLOSED: [2018-03-07 Wed 09:31]
    CLOCK: [2018-03-07 Wed 09:32]--[2018-03-07 Wed 09:45] =>  0:13
    CLOCK: [2018-03-07 Wed 09:15]--[2018-03-07 Wed 09:31] =>  0:16

*** COMPLETED Add to table classes
    CLOSED: [2018-03-07 Wed 14:45]
    CLOCK: [2018-03-07 Wed 09:49]--[2018-03-07 Wed 14:45] =>  4:56

1. class table_standings does not have a display method
2. add a test for your work
in order to do a test just do something simple like create a function in main that creates a dummy table

and calls display on it

test_table_standings() for example

then call it from main just to test

when doing the test just create standings with "random" data, e.g. team="my team" games =12, etc

dont bother reading it etc, should be really simple and self contained, you just want to instantiate a table quickly to see if the display is right

actually maybe the team names should be vaguely sensible since that affects the display

also i think patrick already wrote some code to display a table somewhere, have a look at that pls

*** COMPLETED Fix table function
    CLOSED: [2018-03-07 Wed 16:47]
    CLOCK: [2018-03-07 Wed 15:15]--[2018-03-07 Wed 16:47] =>  1:32

1. clean up generation using my approach above

t.push_back(standings_table_entry("Man-United", 9, 1, 1, 19, 11));

2. update team names to be the longest possible so you can test the width
http://en.cppreference.com/w/cpp/io/manip/setw
e.g.


    std::cout << "no setw:" << 42 << '\n'
              << "setw(6):" << std::setw(6) << 42 << '\
*** COMPLETED Add setw to table
    CLOSED: [2018-03-08 Thu 10:00]
    CLOCK: [2018-03-08 Thu 09:00]--[2018-03-08 Thu 10:00] =>  1:00

ttp://en.cppreference.com/w/cpp/io/manip/setw
e.g.


    std::cout << "no setw:" << 42 << '\n'
              << "setw(6):" << std::setw(6) << 42 << '\
*** COMPLETED Discuss tasks
    CLOSED: [2018-03-08 Thu 10:45]
    CLOCK: [2018-03-08 Thu 10:10]--[2018-03-08 Thu 10:45] =>  0:35
ok chaps, i've integrated all the code you have created thus far into one single game

it does not do a lot really

but it allows you to add users

and see the standings

it links up the data model with the game engine

pls pull then spend the rest of your day analysing the code and making small changes

*** COMPLETED Analyse code
    CLOSED: [2018-03-08 Thu 13:56]
    CLOCK: [2018-03-08 Thu 10:47]--[2018-03-08 Thu 13:08] =>  2:21

*** COMPLETED fix table bug
    CLOSED: [2018-03-08 Thu 15:06]
    CLOCK: [2018-03-08 Thu 13:57]--[2018-03-08 Thu 15:06] =>  1:09

*** COMPLETED Test code
    CLOSED: [2018-03-08 Thu 16:42]
    CLOCK: [2018-03-08 Thu 15:00]--[2018-03-08 Thu 16:00] =>  1:00
Read notes
Test
*** COMPLETED Fix quit bug
    CLOSED: [2018-03-09 Fri 09:58]
    CLOCK: [2018-03-09 Fri 09:00]--[2018-03-09 Fri 10:00] =>  1:00

*** COMPLETED Fix match and add season
    CLOSED: [2018-03-09 Fri 15:03]
    CLOCK: [2018-03-09 Fri 13:53]--[2018-03-09 Fri 15:03] =>  1:10
    CLOCK: [2018-03-09 Fri 10:15]--[2018-03-09 Fri 11:54] =>  1:39
1. name the variables as per diagram e.g. in match you called:

    std::vector<match> day_;

instead of matches

2. use constructors instead of setup

3. fix white space issues: lines too long

4. while you at it add season

ah also we need default constructors for both match and match day

5. add default consturctor

6. add display method to match day and to match

*** COMPLETED Review
    CLOSED: [2018-03-09 Fri 16:49]
    CLOCK: [2018-03-09 Fri 15:03]--[2018-03-09 Fri 16:48] =>  1:45
-pull
-check changes
-rebuild
-look through code
-read comments
-test code
*** COMPLETED Go through last weeks work
    CLOSED: [2018-03-12 Mon 11:00]
    CLOCK: [2018-03-12 Mon 09:00]--[2018-03-12 Mon 10:00] =>  1:00

*** COMPLETED Discuss tasks
    CLOSED: [2018-03-12 Mon 11:00]
    CLOCK: [2018-03-12 Mon 10:00]--[2018-03-12 Mon 10:40] =>  0:40
*** COMPLETED Create match fixtures
    CLOSED: [2018-03-12 Mon 16:08]
    CLOCK: [2018-03-12 Mon 15:02]--[2018-03-12 Mon 16:08] =>  1:06
    CLOCK: [2018-03-12 Mon 13:00]--[2018-03-12 Mon 15:02] =>  2:02
    CLOCK: [2018-03-12 Mon 12:05]--[2018-03-12 Mon 13:00] =>  0:55
    CLOCK: [2018-03-12 Mon 10:40]--[2018-03-12 Mon 12:05] =>  1:25
-add season to engine
-created match fixtures
-created separate days for matches
-made multiple matches for multiple days
*** COMPLETED Review
    CLOSED: [2018-03-13 Tue 09:46]
    CLOCK: [2018-03-13 Tue 09:00]--[2018-03-13 Tue 09:46] =>  0:46

*** COMPLETED Make match by using file
    CLOSED: [2018-03-14 Wed 16:51]
    CLOCK: [2018-03-14 Wed 09:00]--[2018-03-14 Wed 13:00] =>  4:00
    CLOCK: [2018-03-13 Tue 15:00]--[2018-03-13 Tue 16:49] =>  1:49
    CLOCK: [2018-03-13 Tue 13:45]--[2018-03-13 Tue 15:00] =>  1:15
    CLOCK: [2018-03-13 Tue 11:50]--[2018-03-13 Tue 13:00] =>  1:10
    CLOCK: [2018-03-13 Tue 10:00]--[2018-03-13 Tue 11:44] =>  1:44
-got team names from file to make matches

eh eh Niam i think i know why your loops are not working :-)

you have

for(team t : league_.teams()) {
+        bool diff_team = false;
+        std::string team1;
+        std::string team2;
+        do {
+            team1 = t.name();
+            team2 = t.name();
+            if (team1 != team2) {
+                diff_team = true;
+            }

it would help to so a std::cout of the variables by the by

but if you look at the loop is saying

t is each team in league_.teams()

therefore doing t.name() twice means you simply have the same team 2 times :-)

so therefore this is always false

team1 = t.name();
+            team2 = t.name();
+            if (team1 != team2) {

so nothing will ever happen

what you really need is to do two loops

say call the first one t1

and the second one t2

for(team t1 : league_.teams()) {

for(team t2 : league_.teams()) {

then when you do

 team1 = t1.name();
team2 = t2.name();

this will result in different teams (most of the time)

*** Make matches
    CLOCK: [2018-03-16 Fri 09:00]--[2018-03-16 Fri 13:00] =>  4:00
    CLOCK: [2018-03-15 Thu 14:00]--[2018-03-15 Thu 16:28] =>  2:28
    CLOCK: [2018-03-15 Thu 09:00]--[2018-03-15 Thu 13:00] =>  4:00
    CLOCK: [2018-03-14 Wed 13:00]--[2018-03-14 Wed 16:51] =>  3:51
currently matches are 1 per day
--tried to use 2 for loops to assign 3 matches to day for multiple loops
---ended up looping infinitely
-- 1 attempt, separates multiple matches in days but
has same teams playing in one day
*** Research for match problem
    CLOCK: [2018-03-16 Fri 14:00]--[2018-03-16 Fri 16:49] =>  2:49
https://stackoverflow.com/questions/6926433/how-to-shuffle-a-stdvector
http://en.cppreference.com/w/cpp/algorithm/random_shuffle
-- tried to implement in code. not sure how
*** CANCELLED try fixing match with std::shuffle
    CLOSED: [2018-03-19 Mon 11:31]
    CLOCK: [2018-03-19 Mon 09:00]--[2018-03-19 Mon 11:31] =>  2:31

#include <algorithm>
#include <random>
#include <chrono>

// failed attempt to randomise vectors
     /*for(squad t1 : league_.squads()) {
        team1 = t1.name();
        std::cout << team1;
        std::vector<match> test;
        for(squad t2 : league_.squads()) {
            team2 = t2.name();
            std::cout << team2;
            if (team1 != team2) {
                //std::vector<match> test;
                std::cout << "teams are diff, adding match" << std::endl;
                test.push_back(match(team1,0,team2,0,0));
                //match_days.push_back(match_day(test));
           }
       match_days.push_back(match_day(test));
       unsigned seed = std::chrono::system_clock::now().time_since_epoch().count();
       std::shuffle(test.begin(), test.end(), std::default_random_engine(seed));
       }
    }
    unsigned seed = std::chrono::system_clock::now().time_since_epoch().count();
    std::shuffle(match_days.begin(), match_days.end(), std::default_random_engine(seed));*/
*** COMPLETED write permutations out
    CLOSED: [2018-03-19 Mon 14:10]
    CLOCK: [2018-03-19 Mon 11:30]--[2018-03-19 Mon 13:00] =>  1:30
-- discuss task
-- write out permutation
